---
kind: property
id: P:Autodesk.Revit.DB.TableSectionData.LastRowNumber
source: html/e6c7566f-a7ea-31d7-0117-0842cdf04207.htm
---
# Autodesk.Revit.DB.TableSectionData.LastRowNumber Property

The last row in this section of the table.

## Syntax (C#)
```csharp
public int LastRowNumber { get; }
```